  {
  "title": "The BEST Gluten Free Cinnamon Rolls",
  "description": "Soft and pillowy gluten-free cinnamon rolls with a gooey cinnamon sugar filling and sweet vanilla bean cream cheese icing. These achieve an authentic texture without grittiness or mushiness.",
  "recipe_type": "Baking",
  "category": "Breakfast",
  "prep_time": "1 hour 30 minutes",
  "cook_time": "30 minutes",
  "servings": "9 rolls",
  "base_servings": 9,
  "ingredients": [
    "GLUTEN FREE CINNAMON ROLLS:",
    "1 16oz bag Bob's Red Mill Gluten Free Bread Mix (discard yeast packet)",
    "1/2 cup (100g) granulated sugar",
    "4 1/2 tsp (or two packets) instant yeast",
    "1 1/2 tsp baking powder",
    "1/2 tsp baking soda",
    "1 tsp kosher salt",
    "1 1/4 cups (300g) water",
    "1/2 cup (110g) unsalted butter, sliced into tablespoons",
    "1 tsp apple cider vinegar",
    "1 large egg + 1 egg white",
    "Cornstarch for dusting",
    "",
    "CINNAMON SUGAR FILLING:",
    "6 tbsp unsalted butter, very soft",
    "1/2 cup (100g) light brown sugar, packed",
    "2 tbsp ground cinnamon",
    "",
    "VANILLA BEAN CREAM CHEESE ICING:",
    "1/4 cup (55g) unsalted butter, room temperature",
    "4 oz cream cheese, room temperature",
    "1 1/2 cups (170g) powdered sugar",
    "1 tsp vanilla bean paste"
  ],
  "instructions": [
    "Mix bread flour blend, sugar, instant yeast, baking powder, baking soda, and salt using stand mixer with dough hook for one minute.",
    "Heat water, butter, and vinegar for 1-2 minutes until warm (not hot); butter doesn't need to fully melt.",
    "Pour warm mixture into dry ingredients on medium speed, using rubber spatula to incorporate dry remnants.",
    "Add egg and egg white once nearly combined.",
    "Mix on medium-high speed for five minutes to create smooth, slightly stretchy dough.",
    "Rest dough ten minutes while preparing work surface with plastic wrap liberally dusted with cornstarch.",
    "Press dough onto cornstarch bed into a rectangle.",
    "Roll into 13×19 inch rectangle using rolling pin or hand-pressing method.",
    "Prepare filling butter by slicing cold butter into tablespoons, microwaving 15 seconds until just melting, then mashing into smooth consistency with fork.",
    "Spread butter across dough, sprinkle brown sugar evenly, and dust with cinnamon.",
    "Roll dough tightly into log using plastic wrap as guide if needed; brush off excess cornstarch.",
    "Using flavorless dental floss, cut 3 inches from each end (bake separately if desired), then cut remaining dough into 7 rolls for a total of 9.",
    "Crinkle parchment paper, place in 10 inch cast iron skillet, arrange rolls with half-inch spacing (one center roll, six surrounding it).",
    "Preheat oven to lowest setting, turn off, place rolls inside. Allow 45 minutes to 1 hour rise time until doubled in size.",
    "Remove rolls from oven, preheat oven to 350°F.",
    "Bake 25-30 minutes until golden brown on top, or until rolls spring back softly when poked with finger.",
    "Cool rolls while preparing icing.",
    "For the icing: Mash room-temperature butter and cream cheese together using fork until smooth.",
    "Mix in powdered sugar in half-cup increments, followed by vanilla bean paste.",
    "Spread smooth layer of icing atop each warm roll.",
    "Serve and enjoy while warm!"
  ],
  "tags": [
    "gluten-free",
    "cinnamon rolls",
    "cream cheese icing",
    "breakfast",
    "baking",
    "Bob's Red Mill",
    "vanilla bean"
  ],
  "notes": "**Key Tips for Success:**\n\n- This recipe requires Bob's Red Mill Gluten Free Bread Mix for optimal results. The mix is protein-enriched to boost yeast activity. Alternatives like cup-for-cup mixes yielded mushy or gritty results.\n\n- The dough must remain soft and sticky. Roll on a cornstarch bed to prevent drying while allowing workability.\n\n- Use very soft butter for the filling to prevent tearing the delicate dough during application.\n\n- A warm oven environment helps heavy gluten-free dough achieve proper puffing—crucial for light, pillowy rolls.\n\n- **Overnight Option:** After rolls puff in the pan, cover and refrigerate overnight, then bring to room temperature before baking as directed.\n\n- **Vegan Adaptations:** This recipe works with vegan butter substitutes, vegan cream cheese, and vegan egg replacer (following package directions for 1 whole egg plus 1 egg white equivalent).\n\n- Store in airtight container at room temperature for up to 2 days.",
  "source_url": "https://butternutbakeryblog.com/gluten-free-cinnamon-rolls/",
  "allergen_tags": [
    "dairy",
    "eggs",
    "gluten-free"
  ],
  "is_shared_with_household": true
}
